#### Loading libraries

In [1]:
import pandas as pd

#### Load customer dataset

In [2]:
df_customers = pd.read_csv('../../datasets/customers.csv')
df_customers

   customer_id first_name   last_name
0            1     George  Washington
1            2       John       Adams
2            3     Thomas   Jefferson
3            4      James     Madison
4            5      James      Monroe

#### Load and show orders dataset

In [3]:
df_orders = pd.read_csv('../../datasets/orders.csv')
df_orders

   order_id  order_date  amount  customer_id
0         1  07/04/1776  234.56            1
1         2  03/14/1760   78.50            3
2         3  05/23/1784  124.00            2
3         4  09/03/1790   65.50            3
4         5  07/21/1795   25.50           10
5         6  11/27/1787   14.40            9

### Merge two tables base on same column 'customer_id'
    - Ref: http://www.sql-join.com/

In [4]:
df_merged = pd.merge(left=df_customers,
                     right=df_orders, 
                     on='customer_id',
                     how='inner')
df_merged

   customer_id first_name   last_name  order_id  order_date  amount
0            1     George  Washington         1  07/04/1776  234.56
1            2       John       Adams         3  05/23/1784  124.00
2            3     Thomas   Jefferson         2  03/14/1760   78.50
3            3     Thomas   Jefferson         4  09/03/1790   65.50

##### so which customer have largest amount spent ?
##### use groupby then sum on 'amount' column

In [5]:
df_merged.groupby('customer_id').sum()['amount']

customer_id
1    234.56
2    124.00
3    144.00
Name: amount, dtype: float64

In [6]:
df_merged = pd.merge(left=df_customers,
                     right=df_orders, 
                     on='customer_id',
                     how='outer')
df_merged

   customer_id first_name   last_name  order_id  order_date  amount
0            1     George  Washington       1.0  07/04/1776  234.56
1            2       John       Adams       3.0  05/23/1784  124.00
2            3     Thomas   Jefferson       2.0  03/14/1760   78.50
3            3     Thomas   Jefferson       4.0  09/03/1790   65.50
4            4      James     Madison       NaN         NaN     NaN
5            5      James      Monroe       NaN         NaN     NaN
6           10        NaN         NaN       5.0  07/21/1795   25.50
7            9        NaN         NaN       6.0  11/27/1787   14.40